EDTconf/src/InformationRegisters/ВерсииОбъектов/ВерсииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииОбъектов</name>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>АвторВерсии</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTconf/src/Enums/ВариантыВерсионированияОбъектов/ВариантыВерсионированияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыВерсионированияОбъектов</name>
  <enumValues>
    <name>ВерсионироватьПриЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ВерсионироватьПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>НеВерсионировать</name>
  </enumValues>
</mdclass:Enum>

EDTconf/src/CommonModules/ВерсионированиеОбъектовСобытия/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Версионирование объектов".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Записывает версию объекта в информационную базу.
//
// Параметры
//  Источник - Объект - записываемый объект ИБ;
//  Отказ    - Булево - признак отказа от записи объекта.
//
Процедура ЗаписатьВерсиюОбъекта(Источник, Отказ) Экспорт
	
	Перем НомерПоследнейВерсии, Комментарий;
	
	Если Источник.ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;	
	
	Если НЕ ОбъектВерсионируется(Источник, НомерПоследнейВерсии) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьFastInfoset;
	ЗаписьXML.УстановитьДвоичныеДанные();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписатьXML(ЗаписьXML, Источник, НазначениеТипаXML.Явное);
	ДвоичныеДанные = ЗаписьXML.Закрыть();
	ХранилищеДанных = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ВерсионированиеОбъектовКомментарийКВерсии", Комментарий) Тогда
		Комментарий = "";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиВерсииОбъектов = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписиВерсииОбъектов.Объект        = Источник.Ссылка;
	МенеджерЗаписиВерсииОбъектов.ДатаВерсии    = ТекущаяДатаСеанса();
	МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта = ХранилищеДанных;
	МенеджерЗаписиВерсииОбъектов.НомерВерсии   = Число(НомерПоследнейВерсии) + 1;
	МенеджерЗаписиВерсииОбъектов.АвторВерсии   = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписиВерсииОбъектов.Комментарий   = Комментарий;
	
	МенеджерЗаписиВерсииОбъектов.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет настройки версионирования по переданному объекту и
// и возвращает вариант версионирования. Если по объекту не настроено
// версионирование, то он версионируется в соответствии с правилами
// версионирования "по умолчанию".
//
Функция ОбъектВерсионируется(знач Источник, НомерПоследнейВерсии)
	
	ИспользоватьВерсионированиеОбъектов = ПолучитьФункциональнуюОпцию("ИспользоватьВерсионированиеОбъектов");
	// Проверяем, что подсистема версионирования включена
	Если НЕ ИспользоватьВерсионированиеОбъектов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолноеИмяОбъектаМетаданных = Источник.Метаданные().ПолноеИмя();
	ВариантВерсионирования = ВерсионированиеОбъектов.ВариантВерсионированияОбъекта(ПолноеИмяОбъектаМетаданных);
	Если ВариантВерсионирования = Ложь Тогда
		ВариантВерсионирования = ВерсионированиеОбъектов.НастройкаВерсионированияПоУмолчанию(ПолноеИмяОбъектаМетаданных);
	КонецЕсли;
	
	НомерПоследнейВерсии = ВерсионированиеОбъектов.НомерПоследнейВерсии(Источник.Ссылка);
	ВерсионироватьОбъект = Истина;
	Если ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.НеВерсионировать Тогда
		ВерсионироватьОбъект = Ложь;
	ИначеЕсли ВариантВерсионирования = Перечисления.ВариантыВерсионированияОбъектов.ВерсионироватьПриПроведении Тогда
		Если НомерПоследнейВерсии = 0 И НЕ Источник.Проведен Тогда
			ВерсионироватьОбъект = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ВерсионироватьОбъект;
	
КонецФункции
